export default function About() {
  return (
    <div className="w-screen overflow-hidden">
      <main className="lg:w-[760px] lg:mx-auto py-[180px]">
        <h1 className="text-black text-[45px] font-bold leading-[70px]">
          ПОЛИТИКА ОБРАБОТКИ <br />
          <b className="text-[#676C4F] font-bold"> ПЕРСОНАЛЬНЫХ ДАННЫХ</b>
        </h1>
        <p className="text-[16px] leading-[25px]">
          Перед использованием информации, материалов и сервисов интернет сайта
          <a
            href="http://freyamind.com/"
            target="_blank"
            className="text-[#767A60] border-b border-[#767A60]"
          > 
              {" "}http://freyamind.com/{" "}
          </a>
          , пожалуйста, ознакомьтесь с условиями настоящей Политики обработки
          персональных данных.
        </p>
        <h3 className="text-[16px] font-bold mt-[36px]">1. Основные понятия</h3>
        <p className="text-[16px] leading-[25px]">
          1.1. Веб-сайт - совокупность размещенных в сети Интернет веб-страниц,
          объединенных единым адресным пространством домена
          <a
            href="http://freyamind.com/"
            target="_blank"
            className="text-[#767A60] border-b border-[#767A60]"
          >
            {" "} http://freyamind.com/{" "}
          </a>
          . 1.2. Администрация — Sobaki Pavlova LLC, осуществляющий в лице
          уполномоченных лиц администрирование Сайта. Администрации принадлежат
          все соответствующие и исключительные права на сайт{" "}
          <a
            href="http://freyamind.com/"
            target="_blank"
            className="text-[#767A60] border-b border-[#767A60]"
          >
            {" "}http://freyamind.com/{" "}
          </a>
          . 1.3. Пользователь – любое лицо, которое намеревается использовать
          и/или использует Веб-сайт
          <a
            href="http://freyamind.com/"
            target="_blank"
            className="text-[#767A60] border-b border-[#767A60]"
          >
            {" "}http://freyamind.com/{" "}
          </a>
          , обладающее необходимым объемом дееспособности или получившее
          разрешение (согласие) от законных представителей в достаточном объеме
          на заключение и исполнение Соглашения. 1.4. Персональные данные - та
          или иная информация, относящаяся прямо или косвенно определенному
          физическому лицу, и которая позволяет его идентифицировать. 1.5.
          Обработка персональных данных - любые действия с персональными
          данными, совершаемые с применением средств автоматизации или без
          использования подобных средств. Такими действиями могут быть: сбор,
          получение, накопление, хранение, уточнение, использование, извлечение,
          передача, обезличивание, удаление, блокирование, уничтожение
          персональных данных. 1.6. Обезличивание персональных данных –
          действия, результатом которых является невозможность определить
          принадлежность персональных данных конкретному Пользователю или лицу;
          1.7. Предоставление персональных данных – любые действия, результатом
          которых является раскрытие персональных данных определенному кругу
          лиц; 1.8. Уничтожение персональных данных – любые действия,
          результатом которых является безвозвратное уничтожение персональных
          данных на ЭВМ или любых других носителях.
        </p>
        <h3 className="text-[16px] font-bold mt-[36px]">
          2. Обработке подлежат следующие персональные данные Пользователя
        </h3>
        <p className="text-[16px] leading-[25px]">
          2.1. Фамилия, имя, отчество; <br />
          2.2. Электронный адрес; <br />
          2.3. Номера телефонов; <br />
          2.4. IP-адрес;
          <br />
          2.5. Также на сайте происходит сбор и обработка обезличенных данных о
          посетителях (в т.ч. файлов «cookie»).
        </p>
        <h3 className="text-[16px] font-bold mt-[36px]">
          3. Цель обработки персональных данных
        </h3>
        <p className="text-[16px] leading-[25px]">
          3.1. Цель обработки персональных данных Пользователя — информирование
          Пользователя посредством отправки электронных писем; предоставление
          доступа Пользователю к сервисам, информации и/или материалам,
          содержащимся на веб-сайте. <br />
          3.2. На основании полученных данных Администрация имеет право
          направлять Пользователю уведомления о новых продуктах и услугах,
          специальных предложениях и различных событиях. Пользователь всегда
          может отказаться от получения информационных сообщений, направив
          Оператору письмо на адрес электронной почты поддержки с пометкой
          «Отказ от уведомлениях о новых продуктах и услугах и специальных
          предложениях». <br />
          3.3. Обезличенные данные Пользователей, собранные с помощью сервисов
          интернет-статистики, служат для сбора информации о действиях
          Пользователей на сайте, улучшения качества сайта и его содержания.
        </p>
        <h3 className="text-[16px] font-bold mt-[36px]">
          4. Основания обработки персональных данных
        </h3>
        <p className="text-[16px] leading-[25px]">
          4.1. Отправляя свои персональные данные Администрации, Пользователь
          выражает свое согласие с данной Политикой. Администрация обрабатывает
          обезличенные данные о Пользователе в случае, если это разрешено в
          настройках браузера Пользователя (включено сохранение файлов «cookie»
          и использование технологии HTML).
        </p>
        <h3 className="text-[16px] font-bold mt-[36px]">
          5. Порядок сбора, хранения, передачи и других видов обработки
          персональных данных
        </h3>
        <p className="text-[16px] leading-[25px]">
          5.1. Безопасность персональных данных, которые обрабатываются
          Администрацией, обеспечивается путем реализации правовых,
          организационных и технических мер, необходимых для выполнения в полном
          объеме требований действующего законодательства в области защиты
          персональных данных. Администрация обеспечивает сохранность
          персональных данных и принимает все возможные меры, исключающие доступ
          к персональным данным неуполномоченных лиц. <br />
          5.2. При обработке персональных данных Администрация принимает
          необходимые и организационные и технические меры для защиты
          персональных данных от неправомерного доступа к ним, а также от иных
          неправомерных действий в отношении персональных данных. <br />
          5.3. Персональные данные Пользователя ни при каких условиях не будут
          переданы третьим лицам, за исключением случаев, связанных с
          исполнением действующего законодательства. <br />
          5.4. Срок обработки персональных данных является неограниченным.{" "}
          <br />
          5.5. Пользователь может в любой момент отозвать свое согласие на
          обработку персональных данных, направив Администрации уведомление
          посредством электронной почты на электронный адрес Администрации с
          пометкой «Отзыв согласия на обработку персональных данных».
        </p>
        <h3 className="text-[16px] font-bold mt-[36px]">
          6. Трансграничная передача персональных данных
        </h3>
        <p className="text-[16px] leading-[25px]">
          6.1. Администрация до начала осуществления трансграничной передачи
          персональных данных обязана убедиться в том, что иностранным
          государством, на территорию которого предполагается осуществлять
          передачу персональных данных, обеспечивается надежная защита прав
          субъектов персональных данных.
        </p>
        <h3 className="text-[16px] font-bold mt-[36px]">
          7. Заключительные положения
        </h3>
        <p className="text-[16px] leading-[25px]">
          7.1. Обработка персональных данных осуществляется на основе настоящей
          Политики и действующего законодательства Соединенных Штатов Америки.{" "}
          <br />
          7.2. Пользователь может получить разъяснения по вопросам, касающимся
          обработки его персональных данных, обратившись к Администрации с
          помощью электронной почты. <br />
          7.3. В данном документе будут отражены любые изменения Политики
          Администрацией.
        </p>
      </main>
    </div>
  );
}
