import logoFooter from "../../assets/Website Assets/GroupTherapy/Vector (21).svg"

export const GroupFooter = () => {
    return (
        <section className="mt-[80px] mb-[28px] dt:mt-[96px] dt:mb-[90px]">
            <div className="max-w-[364px] mx-[auto] bg-[#E8E8E8] py-[24px] px-[24px] flex flex-col items-center justify-between rounded-[8px] dt:max-w-[1120px]">
                <svg className="mb-[27px]" width="28" height="25" viewBox="0 0 28 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M26.8438 5.26291C26.4249 4.29303 25.8209 3.41413 25.0656 2.67541C24.3098 1.93449 23.4186 1.3457 22.4406 0.941038C21.4265 0.519766 20.3388 0.304135 19.2406 0.306663C17.7 0.306663 16.1969 0.728538 14.8906 1.52541C14.5781 1.71604 14.2812 1.92541 14 2.15354C13.7188 1.92541 13.4219 1.71604 13.1094 1.52541C11.8031 0.728538 10.3 0.306663 8.75937 0.306663C7.65 0.306663 6.575 0.519163 5.55937 0.941038C4.57812 1.34729 3.69375 1.93166 2.93437 2.67541C2.17811 3.41329 1.57399 4.2924 1.15625 5.26291C0.721875 6.27229 0.5 7.34416 0.5 8.44729C0.5 9.48791 0.7125 10.5723 1.13438 11.6754C1.4875 12.5973 1.99375 13.5535 2.64062 14.5192C3.66563 16.0473 5.075 17.641 6.825 19.2567C9.725 21.9348 12.5969 23.7848 12.7188 23.8598L13.4594 24.3348C13.7875 24.5442 14.2094 24.5442 14.5375 24.3348L15.2781 23.8598C15.4 23.7817 18.2687 21.9348 21.1719 19.2567C22.9219 17.641 24.3313 16.0473 25.3563 14.5192C26.0031 13.5535 26.5125 12.5973 26.8625 11.6754C27.2844 10.5723 27.4969 9.48791 27.4969 8.44729C27.5 7.34416 27.2781 6.27229 26.8438 5.26291Z" fill="#F4B8A9"/>
                </svg>
                <h3 className="text-base text-[#343434] text-center mb-[24px]">Понимаем, что вы чувствуете. Говорим с вами на одном языке.</h3>
                <p className="text-sm text-[#3434348F] text-center mb-[24px]">При регистрации вы будете направлены на наш сервис, где осуществляется запись встреч.</p>
                <img src={logoFooter} alt="logo" />
            </div>
        </section>
    )
}