


export const GroupAbout = () => {
    return (
        <section className="my-[40px] dt:my-[unset] dt:mt-[112px] dt:max-w-[1120px] dt:mx-auto" id="groupAbout">
            <div className="max-w-[364px] mx-auto bg-[#F3E5D8] px-[16px] py-[24px] rounded-[8px] h-[588px] dt:max-w-[864px] dt:px-[32px] dt:flex dt:self-start dt:h-[387px] dt:ml-0">
                <div className="relative z-0">
                    <svg className="absolute top-[-80px] left-[-50px] z-1 dt:top-[-100px] dt:left-[-40px]" width="210" height="256" viewBox="0 0 210 256" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M45.5793 31.5601C41.6005 33.1167 38.6715 37.158 36.895 43.4176C35.1226 49.6628 34.5431 57.974 35.1544 67.797C36.3765 87.4343 42.3453 112.938 52.7908 139.638C63.2363 166.338 76.1587 189.122 88.5865 204.376C94.8032 212.006 100.869 217.717 106.408 221.102C111.961 224.494 116.855 225.475 120.833 223.919C124.812 222.362 127.741 218.321 129.518 212.061C131.29 205.816 131.87 197.505 131.258 187.682C130.036 168.044 124.067 142.54 113.622 115.84C103.176 89.1402 90.2541 66.3564 77.8263 51.103C71.6096 43.4729 65.5442 37.7613 60.0044 34.3767C54.452 30.9844 49.5581 30.0035 45.5793 31.5601Z" stroke="#F4B8A9" stroke-width="1.5"/>
                        <path d="M11.3253 53.5211C8.25852 56.4958 7.12115 61.3556 7.90478 67.815C8.68662 74.2596 11.3678 82.1478 15.7319 90.9694C24.4563 108.605 39.8276 129.813 59.7897 150.393C79.7517 170.972 100.483 186.982 117.844 196.24C126.529 200.87 134.331 203.791 140.749 204.768C147.182 205.748 152.074 204.759 155.141 201.785C158.207 198.81 159.345 193.95 158.561 187.491C157.779 181.046 155.098 173.158 150.734 164.336C142.01 146.701 126.638 125.492 106.676 104.913C86.7142 84.3334 65.9834 68.3234 48.622 59.0661C39.9374 54.4353 32.1346 51.5152 25.7168 50.5374C19.2843 49.5575 14.392 50.5463 11.3253 53.5211Z" stroke="#F4B8A9" stroke-width="1.5"/>
                    </svg>
                    <div className="absolute z-[2]">
                        <h1 className="font-[AsgardBold] text-[36px] leading-[36px] text-[#343434] font-normal mb-[40px] -tracking-[.02em] dt:text-[48px] dt:leading-[48px] dt:w-[800px]">Что такое групповая терапия?</h1>
                        <p className="font-normal text-lg text-[#343434] dt:w-[800px]">
                            Это <span className="font-semibold">доказательный метод</span> психотерапии, который <span className="font-semibold">помогает</span> справиться с коллективной травмой, тревожностью и депрессией. В группе до 10 человек, встречи проходят <span className="font-semibold">1 раз в неделю.</span>
                            <br/>
                            <br/>
                            Терапия проходит не только во время группы, но и между встречами, благодаря небольшим домашним заданиям. Наша цель- научить вас помогать себе самостоятельно.
                        </p>
                    </div>
                </div>
            </div>
        </section>
    )
}
